In [1]:
#importing the required libraries
import pandas as pd

In [2]:
#2 main datatypes
series=pd.Series(["BMW", "Toyota", "Honda"])

In [4]:
#display the series
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [5]:
#series = 1-dimensional
colours=pd.Series(["Red","Blue","White"])
colours

0      Red
1     Blue
2    White
dtype: object

In [6]:
#DataFrame = 2-dimensional

In [7]:
#DataFrame from two series and displaying it
car_data=pd.DataFrame({"Car make:":series,"Colour":colours})
car_data

  Car make: Colour
0       BMW    Red
1    Toyota   Blue
2     Honda  White

In [8]:
#Importing data
car_sales=pd.read_csv("car-sales.csv")

In [9]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [13]:
#Exporting a dataframe
car_sales.to_csv("exported-car-sales.csv", index=False)

In [15]:
exported_car_sales=pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describing Data

In [16]:
#Attribute doesn't have brackets
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [19]:
#Returns the columns names in list
car_columns=car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [22]:
#Returns the (start, stop, step) of the table
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [24]:
#Give some statistics about the numeric data
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [25]:
 #Give some information about the data
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [37]:
#Give the mean value of all the columns having 'int' datatype
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [38]:
car_prices=pd.Series([3000,1500, 111250])
car_prices.mean()

38583.333333333336

In [39]:
#Return the total number of doors in 'Door' column
car_sales["Doors"].sum()

40

In [40]:
#Return the number of rows in the data
len(car_sales)

10